app/views/developers/_form.html.erb

    <%= f.label :Project_id %><br>
    <%= select(:developer, :Project_id, Project.all.collect{ |c| [c.title,c.id]}) %>
---
SELECT "projects".* FROM "projects"