app/views/stories/_form.html.erb

SELECT "projects".* FROM "projects"
---
      <%= f.label :Project %><br>
     <%= select("story", "Project_id", Project.all.collect{ |c| [c.title, c.id]}) %>