app/controllers/admins_controller.rb

  def index
    @admins = Admin.all
    @projects = Project.all
    @developers = Developer.all
---
SELECT "admins".* FROM "admins"
SELECT "projects".* FROM "projects"
SELECT "developers".* FROM "developers"

  def show
    @admins = Admin.all
    @projects = Project.all
    @developers = Developer.all
---
SELECT "admins".* FROM "admins"
SELECT "projects".* FROM "projects"
SELECT "developers".* FROM "developers"

  def showstories
    @t0=0
    @t1=0
    @t2=0
    @t3=0
    @t4=0
    @t5=0
    @stories = Story.all
    @project = Project.find(params[:id])
---
SELECT "stories".* FROM "stories"
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 4]]

  def destroyprojects
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 4]]