app/controllers/developers_controller.rb

  def index
    @developers = Developer.all
    @project = Project.all
---
SELECT "developers".* FROM "developers"
SELECT "projects".* FROM "projects"

  def show
 #   @developer =Developer.all
    @project = Project.all
    @stories = Story.all.select{|s| s.Developer_id == @developer.id}
---
SELECT "projects".* FROM "projects"
SELECT "stories".* FROM "stories"

  def create
    @developer = Developer.new(developer_params)

    respond_to do |format|
      if @developer.save
---
INSERT INTO "developers" ("name", "email", "password", "Project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "aaaaa"], ["email", "aaa@aaa.com"], ["password", "aaa"], ["Project_id", 10], ["created_at", "2015-02-17 01:26:39.653209"], ["updated_at", "2015-02-17 01:26:39.653209"]]

  def createstory
    @story = Story.new
    #Story.new.Developer_id = params[:id]
    @developer = Developer.find(params[:id])
    @projects = Project.all
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = ? LIMIT 1  [["id", 1]]
SELECT "projects".* FROM "projects"

  def signup
    @stories = Story.all.select{|s| s.Project_id == @developer.Project_id}
---
SELECT "stories".* FROM "stories"

  def update
    respond_to do |format|
      if @developer.update(developer_params)
---
UPDATE "developers" SET "password" = ?, "updated_at" = ? WHERE "developers"."id" = ?  [["password", "123"], ["updated_at", "2015-02-17 21:51:44.401040"], ["id", 1]]

    def set_developer
      @developer = Developer.find(params[:id])
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = ? LIMIT 1  [["id", 1]]