app/controllers/projects_controller.rb

SELECT "stories".* FROM "stories"
---
  def show
    @t0=0
    @t1=0
    @t2=0
    @t3=0
    @t4=0
    @t5=0
    @stories = Story.all

INSERT INTO "projects" ("title", "description", "developer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "fairy tale"], ["description", "Fairy tale"], ["developer", "aaa"], ["created_at", "2015-02-17 01:18:45.256926"], ["updated_at", "2015-02-17 01:18:45.256926"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save