app/controllers/stories_controller.rb

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 23]]
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = ? LIMIT 1  [["id", 28]]
---
  def show
    @stories = Story.find(params[:id])
    @developer = Developer.all.select{|s| s.id == @stories.Developer_id}

INSERT INTO "stories" ("Developer_id", "title", "description", "point_value", "Stage", "Project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @story = Story.new(story_params)
    #@project = Project.find(params[:Project_id])
    #@story = @project.stories.create(story_params)
    #redirect_to project_path(@project)

    respond_to do |format|
      if @story.save

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 15]]
---
    def set_story
      @story = Story.find(params[:id])